In [18]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [24]:
df = pd.read_csv('homeprices.csv')

In [25]:
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

### We need to first preprocess data and handle the NaN accordingly

In [20]:
# since for one of them bedrooms is missing, we need to handle it
# we can replace it with median

In [27]:
import math

median_bedrooms = math.floor(df['bedrooms'].median())        # keep it integral
median_bedrooms

4

In [32]:
df['bedrooms'] = df['bedrooms'].fillna(median_bedrooms)
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [33]:
reg = linear_model.LinearRegression()
reg.fit(df[['area', 'bedrooms', 'age']], df['price'])     

# independent variables for x values and dependent variables (here price) for y value

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [34]:
reg.coef_

array([  112.06244194, 23388.88007794, -3231.71790863])

In [40]:
reg.predict([[3200, 4, 20]])

array([608843.97821933])

In [41]:
reg.predict([[2500, 4, 5]])

array([578876.03748933])

# Exercise

In [61]:
df = pd.read_csv('hiring.csv', sep='\t')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [67]:
df.rename(columns={'test_score(out of 10)': 'testscore', 'interview_score(out of 10)': 'interviewscore',
                  'salary($)' : 'salary'}, inplace="True")
df

   experience  testscore  interviewscore  salary
0           0        8.0               9   50000
1           0        8.0               6   45000
2           5        6.0               7   60000
3           2       10.0              10   65000
4           7        9.0               6   70000
5           3        7.0              10   62000
6          10        NaN               7   72000
7          11        7.0               8   80000

In [63]:
from word2number import w2n

df['experience'] = df['experience'].fillna('zero')
print(df)

df['experience'] = df['experience'].apply(lambda x : w2n.word_to_num(x))


df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [68]:

median_testscore = df['testscore'].median()
median_testscore

8.0

In [69]:
df

   experience  testscore  interviewscore  salary
0           0        8.0               9   50000
1           0        8.0               6   45000
2           5        6.0               7   60000
3           2       10.0              10   65000
4           7        9.0               6   70000
5           3        7.0              10   62000
6          10        NaN               7   72000
7          11        7.0               8   80000

In [74]:
df['testscore'] = df['testscore'].fillna(median_testscore)
df

   experience  testscore  interviewscore  salary
0           0        8.0               9   50000
1           0        8.0               6   45000
2           5        6.0               7   60000
3           2       10.0              10   65000
4           7        9.0               6   70000
5           3        7.0              10   62000
6          10        8.0               7   72000
7          11        7.0               8   80000

In [76]:
from sklearn import linear_model

In [78]:
reg = linear_model.LinearRegression()
reg.fit(df[['experience', 'testscore', 'interviewscore']], df['salary'])

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [79]:
reg.predict([[2, 9, 6]])

array([53205.96797671])

In [80]:
reg.predict([[12, 10, 10]])

array([92002.18340611])

In [81]:
reg.coef_

array([2812.95487627, 1845.70596798, 2205.24017467])

In [82]:
reg.intercept_

17737.263464337695